spec/fixtures/proofing/aamva/requests/verification_request.xml

<soap:Envelope xmlns:ns='http://aamva.org/dldv/wsdl/2.1' xmlns:ns1='http://aamva.org/niem/extensions/1.0' xmlns:ns2='http://niem.gov/niem/niem-core/2.0' xmlns:soap='http://www.w3.org/2003/05/soap-envelope'>
  <soap:Header xmlns:wsa='http://www.w3.org/2005/08/addressing'>
    <wsa:Action>http://aamva.org/dldv/wsdl/2.1/IDLDVService21/VerifyDriverLicenseData</wsa:Action>
  </soap:Header>
  <soap:Body>
    <ns:VerifyDriverLicenseData>
      <ns:token>
        KEYKEYKEY
      </ns:token>
      <ns:verifyDriverLicenseDataRequest>
        <ns1:ControlData>
          <ns1:MessageAddress>
            <ns1:TransactionLocatorId>
              1234-abcd-efgh
            </ns1:TransactionLocatorId>
            <ns1:MessageOriginatorId>GSA</ns1:MessageOriginatorId>
            <ns1:MessageDestinationId>CA</ns1:MessageDestinationId>
          </ns1:MessageAddress>
        </ns1:ControlData>
        <ns2:DriverLicenseIdentification>
          <ns2:IdentificationID xsi:type='ns2:PersonNameTextType' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>123456789</ns2:IdentificationID>
        </ns2:DriverLicenseIdentification>
        <ns1:PersonBirthDate>1942-10-29</ns1:PersonBirthDate>
        <ns2:PersonName>
          <ns2:PersonGivenName>Testy</ns2:PersonGivenName>
          <ns2:PersonSurName>McTesterson</ns2:PersonSurName>
        </ns2:PersonName>
        <ns1:Address>
          <ns2:AddressDeliveryPointText>123 Sunnyside way</ns2:AddressDeliveryPointText>
          <ns2:LocationCityName>Sterling</ns2:LocationCityName>
          <ns2:LocationStateUsPostalServiceCode>VA</ns2:LocationStateUsPostalServiceCode>
          <ns2:LocationPostalCode>20176</ns2:LocationPostalCode>
        </ns1:Address>
      </ns:verifyDriverLicenseDataRequest>
    </ns:VerifyDriverLicenseData>
  </soap:Body>
</soap:Envelope>
